examples/online_serving/disaggregated_serving_p2p_nccl_xpyd/benchmark_output/P_tp2_dp2_D_tp2_dp2/benchmark.log
INFO 11-04 05:13:50 [__init__.py:225] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x715d716484a0>, seed=1762233227, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=512, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=10001, endpoint='/v1/completions', header=None, max_concurrency=64, model='meta-llama/Meta-Llama-3-70B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
INFO 11-04 05:13:55 [datasets.py:603] Sampling input_len from [511, 511] and output_len from [512, 512]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:08 remaining
 |          | 00:24 elapsed, 4375:15:01 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/128 [00:00<?, ?it/s]
  1%|          | 1/128 [00:00<00:54,  2.33it/s]
  2%|▏         | 2/128 [00:02<03:17,  1.57s/it]
  2%|▏         | 3/128 [00:02<01:53,  1.10it/s]
  4%|▍         | 5/128 [00:03<00:53,  2.32it/s]
  5%|▍         | 6/128 [00:03<01:06,  1.84it/s]
  8%|▊         | 10/128 [00:04<00:26,  4.37it/s]
 10%|█         | 13/128 [00:04<00:18,  6.14it/s]
 12%|█▏        | 15/128 [00:04<00:15,  7.45it/s]
 13%|█▎        | 17/128 [00:05<00:28,  3.95it/s]
 15%|█▍        | 19/128 [00:05<00:21,  5.13it/s]
 16%|█▋        | 21/128 [00:05<00:20,  5.13it/s]
 18%|█▊        | 23/128 [00:13<02:04,  1.19s/it]
 19%|█▉        | 24/128 [00:16<02:50,  1.64s/it]
 20%|█▉        | 25/128 [00:25<05:21,  3.12s/it]
 23%|██▎       | 30/128 [00:26<02:09,  1.32s/it]
 28%|██▊       | 36/128 [00:26<01:02,  1.48it/s]
 30%|██▉       | 38/128 [00:26<00:50,  1.77it/s]
 31%|███▏      | 40/128 [00:26<00:42,  2.09it/s]
 40%|███▉      | 51/128 [00:27<00:14,  5.23it/s]
 42%|████▏     | 54/128 [00:27<00:15,  4.87it/s]
 53%|█████▎    | 68/128 [00:28<00:06,  9.53it/s]
 55%|█████▌    | 71/128 [00:28<00:05, 10.34it/s]
 58%|█████▊    | 74/128 [00:28<00:05, 10.37it/s]
 59%|█████▉    | 76/128 [00:29<00:05,  9.72it/s]
 68%|██████▊   | 87/128 [00:30<00:04,  9.44it/s]
 70%|██████▉   | 89/128 [00:33<00:10,  3.61it/s]
 70%|███████   | 90/128 [00:33<00:10,  3.48it/s]
 71%|███████   | 91/128 [00:34<00:12,  3.04it/s]
 72%|███████▏  | 92/128 [00:35<00:12,  2.80it/s]
 73%|███████▎  | 93/128 [00:35<00:15,  2.24it/s]
 73%|███████▎  | 94/128 [00:37<00:23,  1.44it/s]
 75%|███████▌  | 96/128 [00:39<00:26,  1.20it/s]
 76%|███████▌  | 97/128 [00:42<00:37,  1.20s/it]
 77%|███████▋  | 98/128 [00:49<01:09,  2.33s/it]
 78%|███████▊  | 100/128 [00:49<00:41,  1.47s/it]
 80%|███████▉  | 102/128 [00:49<00:25,  1.01it/s]
 80%|████████  | 103/128 [00:49<00:21,  1.18it/s]
 81%|████████▏ | 104/128 [00:49<00:16,  1.41it/s]
 85%|████████▌ | 109/128 [00:50<00:06,  2.98it/s]
 86%|████████▌ | 110/128 [00:50<00:05,  3.26it/s]
 87%|████████▋ | 111/128 [00:50<00:04,  3.43it/s]
 90%|████████▉ | 115/128 [00:51<00:02,  4.97it/s]
 97%|█████████▋| 124/128 [00:51<00:00, 11.17it/s]
 98%|█████████▊| 126/128 [00:51<00:00, 10.31it/s]
100%|██████████| 128/128 [00:52<00:00,  9.60it/s]
100%|██████████| 128/128 [00:52<00:00,  2.46it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  52.01     
Total input tokens:                      65408     
Total generated tokens:                  47499     
Request throughput (req/s):              2.46      
Output token throughput (tok/s):         913.26    
Peak output token throughput (tok/s):    1472.00   
Peak concurrent requests:                82.00     
Total Token throughput (tok/s):          2170.86   
---------------Time to First Token----------------
Mean TTFT (ms):                          2453.82   
Median TTFT (ms):                        2638.42   
P99 TTFT (ms):                           5135.06   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          51.54     
Median TPOT (ms):                        46.88     
P99 TPOT (ms):                           86.23     
---------------Inter-token Latency----------------
Mean ITL (ms):                           48.14     
Median ITL (ms):                         44.33     
P99 ITL (ms):                            69.96     
==================================================